""" """

""" 1 Задача
Напишите функцию, которая будет принимать список словарей с данными о банковских операциях и строку поиска, 
а возвращать список словарей, у которых в описании есть данная строка. 

При реализации этой функции можно использовать библиотеку re для работы с регулярными выражениями.
Расположение новой функции в структуре проекта определите самостоятельно.
"""

""" 2 Задача
Напишите функцию, которая будет принимать список словарей с данными о банковских операциях и список категорий операций, 
а возвращать словарь, в котором ключи — это названия категорий, а значения — это количество операций в каждой категории.
Категории операций хранятся в поле description.

Расположение новой функции в структуре проекта определите самостоятельно.
"""